<img src="logo.png">

# Pandas

Pandas provee dos estructuras de datos: dataframes y series. De hecho Pandas está programado a través de Numpy.

In [2]:
import pandas as pd
import numpy as np

## Series

Los objetos instanciado de la clase pandas.Series son de una sola dimensión y pueden ser al ingresar como argumento de data objetos de tipo:

* tuple
* list
* dict
* numpy.ndarray

A las series se les puede asignar un nombre mediante el parametro name.

In [18]:
np.random.seed(2022)
np.random.rand(8)

array([0.00935861, 0.49905781, 0.11338369, 0.04997402, 0.68540759,
       0.48698807, 0.89765723, 0.64745207])

In [17]:
np.random.seed(2022)
serie_1 = pd.Series(np.random.rand(8))
serie_1

0    0.009359
1    0.499058
2    0.113384
3    0.049974
4    0.685408
5    0.486988
6    0.897657
7    0.647452
dtype: float64

In [23]:
np.random.seed(2022)
serie_1 = pd.Series(np.random.rand(8), name = "mi_primer_serie")
serie_1

0    0.009359
1    0.499058
2    0.113384
3    0.049974
4    0.685408
5    0.486988
6    0.897657
7    0.647452
Name: mi_primer_serie, dtype: float64

In [25]:
serie_1[4]

0.6854075942430917

In [30]:
# Podemos especificar los valores de los índices
np.random.seed(2022)
serie_2 = pd.Series(np.random.rand(8),index = range(1,9),name = "Mi_segunda_serie")
serie_2

1    0.009359
2    0.499058
3    0.113384
4    0.049974
5    0.685408
6    0.486988
7    0.897657
8    0.647452
Name: Mi_segunda_serie, dtype: float64

In [31]:
# Podemos especificar los valores de los índices mas generalmente
np.random.seed(2022)
serie_3 = pd.Series(np.random.rand(5),index = [4,6,1,2,8])
serie_3

4    0.009359
6    0.499058
1    0.113384
2    0.049974
8    0.685408
dtype: float64

In [ ]:
serie_3[0]

In [34]:
serie_3[4]

0.009358613807764704

In [36]:
serie_4 = pd.Series(np.random.rand(5),index = ["a","a","i","o","u"])
serie_4

a    0.486988
a    0.897657
i    0.647452
o    0.896963
u    0.721135
dtype: float64

In [39]:
serie_4[0]

0.4869880682157304

In [40]:
serie_4["a"]

a    0.486988
a    0.897657
dtype: float64

Incluso los diccionarios se pueden convertir en series

In [43]:
diccionario = {"Nombre":["Héctor","Manuel"],"Apellido":"Garduño"}
pd.Series(diccionario)

Nombre      [Héctor, Manuel]
Apellido             Garduño
dtype: object

Es importante notar que las series son estructuras de datos en una sola dimensión. Si queremos estructuras mas complejas, debemos usar dataframes.

## Dataframes

Los dataframes son similares a un aerreglo en 2 dimensiones de Numpy. Sin embargo, a diferencia de los arreglos de Numpy, no todas las columnas de estos objetos deben de ser necesariamente del mismo tipo.

La clase **pandas.DataFrame** permite crear dataframes a partir de datos que pueden corresponder a:

* Objetos de tipo dict.
* Series objetos tipo tuple.
* Objetos numpy.ndarray (arreglos que contienen sólo números).
* Otros objetos instanciado de pandas.DataFrame.

Dichos datos pueden ser ingresados como argumentos del parámetro data al instanciarlos.

Los dataframes indexan por defecto las columnas y los encabrezados con valores numéricos. Sin embargo, estos pueden ser modificados por el usuario.

In [47]:
pd.DataFrame(data=[(0, 8, 21), (1, 2, 3), (2, 3, 4), (3, 4, 5)])

   0  1   2
0  0  8  21
1  1  2   3
2  2  3   4
3  3  4   5

In [2]:
estudiantes = {'Nombre':["Hugo", "Paco", "Luis" ,"Pedro", "Juan", "Pablo"], 
                'Apellido':["López", "Silva", "Oca" , "Ramírez", "Gutiérrez", np.nan ], 
                'Matrícula':["123455", "736923", "971298" ,"123098", "987656", "878652"], 
                'Edad':[20, 35, 30 ,25, np.nan,23]}

In [3]:
pd.DataFrame(estudiantes)

  Nombre   Apellido Matrícula  Edad
0   Hugo      López    123455  20.0
1   Paco      Silva    736923  35.0
2   Luis        Oca    971298  30.0
3  Pedro    Ramírez    123098  25.0
4   Juan  Gutiérrez    987656   NaN
5  Pablo        NaN    878652  23.0

In [4]:
matriz = np.arange(9).reshape(3,3)
matriz

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [63]:
pd.DataFrame(matriz)

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

El parámetro index, permite incluir un índice a cada renglón.

In [6]:
registro = ["1a persona","2a persona","3a persona","4a persona","5a persona","6a persona"]

In [7]:
pd.DataFrame(data = estudiantes, index = registro)

           Nombre   Apellido Matrícula  Edad
1a persona   Hugo      López    123455  20.0
2a persona   Paco      Silva    736923  35.0
3a persona   Luis        Oca    971298  30.0
4a persona  Pedro    Ramírez    123098  25.0
5a persona   Juan  Gutiérrez    987656   NaN
6a persona  Pablo        NaN    878652  23.0

El parámetro columns permite nombrar a las columnas.

In [66]:
matriz = np.arange(9).reshape((3,3))

In [67]:
matriz

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [68]:
pd.DataFrame(matriz, index=['uno','dos','tres'], columns=['a', 'b', 'c'])

      a  b  c
uno   0  1  2
dos   3  4  5
tres  6  7  8

In [8]:
pd.DataFrame(
[["Hugo","López",123455,20],
 ["Paco","Silva",736923],
 ["Luis","Oca",971298],
 ["Pedro","Ramírez",123098]    
], columns = ["Nombre","Apellido","Matrícula","Edad"],    
    index = ["Registro 1","Registro 2","Registro 3","Registro 4"]
    
)

           Nombre Apellido  Matrícula  Edad
Registro 1   Hugo    López     123455  20.0
Registro 2   Paco    Silva     736923   NaN
Registro 3   Luis      Oca     971298   NaN
Registro 4  Pedro  Ramírez     123098   NaN

## Acceso a los elementos de un dataframe

Podemos accesar a los elementos de un dataframe mediante las siguientes maneras. Consideremos nuevamente el dataframe anterior:

In [58]:
estudiantes = pd.DataFrame(
[["Hugo","López","123455",20],
 ["Paco","Silva","736923",35],
 ["Luis","Oca","971298"],
 ["Pedro","Ramírez","123098"]    
], index = ["Registro 1","Registro 2","Registro 3","Registro 4"],
    columns = ["Nombre","Apellido","Matrícula","Edad"]
)

estudiantes

           Nombre Apellido Matrícula  Edad
Registro 1   Hugo    López    123455  20.0
Registro 2   Paco    Silva    736923  35.0
Registro 3   Luis      Oca    971298   NaN
Registro 4  Pedro  Ramírez    123098   NaN

In [59]:
# Acceso a una columna: usando el nombre de los campos

estudiantes["Matrícula"]

Registro 1    123455
Registro 2    736923
Registro 3    971298
Registro 4    123098
Name: Matrícula, dtype: object

In [60]:
# Acceso a varias columnas: usando el nombre de los campos

estudiantes[["Nombre","Edad"]]

           Nombre  Edad
Registro 1   Hugo  20.0
Registro 2   Paco  35.0
Registro 3   Luis   NaN
Registro 4  Pedro   NaN

In [61]:
# Acceso a una fila mediante el nombre del ínice del registro

estudiantes.loc[["Registro 2","Registro 4"]]

           Nombre Apellido Matrícula  Edad
Registro 2   Paco    Silva    736923  35.0
Registro 4  Pedro  Ramírez    123098   NaN

In [62]:
# Acceso a una fila mediante el número del índice del registro

estudiantes.iloc[1]

Nombre         Paco
Apellido      Silva
Matrícula    736923
Edad           35.0
Name: Registro 2, dtype: object

In [63]:
# Acceso a ciertas columnas y ciertas filas.

estudiantes.loc[["Registro 1","Registro 4"]][["Nombre","Edad"]]

           Nombre  Edad
Registro 1   Hugo  20.0
Registro 4  Pedro   NaN

In [64]:
estudiantes[["Nombre","Edad"]].loc[["Registro 1","Registro 4"]]

           Nombre  Edad
Registro 1   Hugo  20.0
Registro 4  Pedro   NaN

## Operaciones básicas de dataframes

También es posible añadir nuevas columnas a un dataframe utilizando columnas que ya existen.

In [65]:
estudiantes.columns

Index(['Nombre', 'Apellido', 'Matrícula', 'Edad'], dtype='object')

In [66]:
estudiantes["Nombre completo"] = estudiantes["Nombre"] + " " + estudiantes["Apellido"]
estudiantes

           Nombre Apellido Matrícula  Edad Nombre completo
Registro 1   Hugo    López    123455  20.0      Hugo López
Registro 2   Paco    Silva    736923  35.0      Paco Silva
Registro 3   Luis      Oca    971298   NaN        Luis Oca
Registro 4  Pedro  Ramírez    123098   NaN   Pedro Ramírez

In [67]:
# Eliminado de columnas

estudiantes.drop("Nombre completo", axis = 1, inplace = True)
estudiantes

           Nombre Apellido Matrícula  Edad
Registro 1   Hugo    López    123455  20.0
Registro 2   Paco    Silva    736923  35.0
Registro 3   Luis      Oca    971298   NaN
Registro 4  Pedro  Ramírez    123098   NaN

In [68]:
# Indexar numéricamente los registros

estudiantes.reset_index(inplace = True)
estudiantes

        index Nombre Apellido Matrícula  Edad
0  Registro 1   Hugo    López    123455  20.0
1  Registro 2   Paco    Silva    736923  35.0
2  Registro 3   Luis      Oca    971298   NaN
3  Registro 4  Pedro  Ramírez    123098   NaN

In [69]:
# Acceso a ciertas columnas y ciertas filas.

estudiantes.loc[[0,3],["Matrícula","Edad"]]

  Matrícula  Edad
0    123455  20.0
3    123098   NaN

In [70]:
# Incluso podemos hacer selección por filtrado

#estudiantes[estudiantes["Edad"] > 20][["index","Edad","Matrícula"]]

estudiantes[estudiantes["Edad"] > 20][["index","Edad"]]

        index  Edad
1  Registro 2  35.0

In [71]:
# Cambiando los nombres de las columnas

estudiantes.columns = ["Campo 1","Campo 2","Campo 3","Campo 4","Campo 5"]
estudiantes

      Campo 1 Campo 2  Campo 3 Campo 4  Campo 5
0  Registro 1    Hugo    López  123455     20.0
1  Registro 2    Paco    Silva  736923     35.0
2  Registro 3    Luis      Oca  971298      NaN
3  Registro 4   Pedro  Ramírez  123098      NaN

In [72]:
# cambiando nombre de columnas
estudiantes.rename(columns={"Campo 2":"campo_2"}, inplace=True)
estudiantes

      Campo 1 campo_2  Campo 3 Campo 4  Campo 5
0  Registro 1    Hugo    López  123455     20.0
1  Registro 2    Paco    Silva  736923     35.0
2  Registro 3    Luis      Oca  971298      NaN
3  Registro 4   Pedro  Ramírez  123098      NaN

In [73]:
# Cambiando los nombres de las filas
# Coloco los datos de la columna elegida como nombre de la fila
# Elimino la columna_2 para que no este 2 veces

estudiantes.index = estudiantes["campo_2"]
estudiantes.drop(axis=1, columns="campo_2", inplace=True)
estudiantes

            Campo 1  Campo 3 Campo 4  Campo 5
campo_2
Hugo     Registro 1    López  123455     20.0
Paco     Registro 2    Silva  736923     35.0
Luis     Registro 3      Oca  971298      NaN
Pedro    Registro 4  Ramírez  123098      NaN

In [74]:
# Agregado de una fila

nuevo_elemento = "Registro 5, González, 2233434, 29"
nuevo_elemento.split(", ")

# Va a buscar el indice pero como no lo encuentra, entonces lo crea e inserta la información

estudiantes.loc["Marcos"] = nuevo_elemento.split(",")
estudiantes

            Campo 1    Campo 3   Campo 4 Campo 5
campo_2
Hugo     Registro 1      López    123455    20.0
Paco     Registro 2      Silva    736923    35.0
Luis     Registro 3        Oca    971298     NaN
Pedro    Registro 4    Ramírez    123098     NaN
Marcos   Registro 5   González   2233434      29

In [75]:
estudiantes.iloc[-1]

Campo 1    Registro 5
Campo 3      González
Campo 4       2233434
Campo 5            29
Name: Marcos, dtype: object

In [76]:
"ronal_leiva@hotmail.com".partition("@")

('ronal_leiva', '@', 'hotmail.com')

In [77]:
# Visualizar encabezado y cola

#estudiantes.head(8) 
estudiantes.tail(3)

            Campo 1    Campo 3   Campo 4 Campo 5
campo_2
Luis     Registro 3        Oca    971298     NaN
Pedro    Registro 4    Ramírez    123098     NaN
Marcos   Registro 5   González   2233434      29

In [78]:
# Convierto los datos de toda una columna en numerico y con decimales
estudiantes["Campo 5"] = pd.to_numeric(estudiantes["Campo 5"], downcast = "float")
estudiantes

            Campo 1    Campo 3   Campo 4  Campo 5
campo_2
Hugo     Registro 1      López    123455     20.0
Paco     Registro 2      Silva    736923     35.0
Luis     Registro 3        Oca    971298      NaN
Pedro    Registro 4    Ramírez    123098      NaN
Marcos   Registro 5   González   2233434     29.0

In [79]:
estudiantes["Campo 5"].mean()

28.0

In [80]:
estudiantes["Campo 5"].value_counts()

20.0    1
35.0    1
29.0    1
Name: Campo 5, dtype: int64

In [81]:
estudiantes.loc["Jennifer"] = ["Registro 6","Ramírez","777222",30]
estudiantes

             Campo 1    Campo 3   Campo 4  Campo 5
campo_2
Hugo      Registro 1      López    123455     20.0
Paco      Registro 2      Silva    736923     35.0
Luis      Registro 3        Oca    971298      NaN
Pedro     Registro 4    Ramírez    123098      NaN
Marcos    Registro 5   González   2233434     29.0
Jennifer  Registro 6    Ramírez    777222     30.0

In [82]:
estudiantes["Campo 3"].value_counts()

Ramírez      2
López        1
Silva        1
Oca          1
 González    1
Name: Campo 3, dtype: int64

In [83]:
# Ordenar en base a una columna y en orden descendente

estudiantes.sort_values(by = "Campo 5",inplace = True, ascending=False)
estudiantes

             Campo 1    Campo 3   Campo 4  Campo 5
campo_2
Paco      Registro 2      Silva    736923     35.0
Jennifer  Registro 6    Ramírez    777222     30.0
Marcos    Registro 5   González   2233434     29.0
Hugo      Registro 1      López    123455     20.0
Luis      Registro 3        Oca    971298      NaN
Pedro     Registro 4    Ramírez    123098      NaN

In [84]:
# Calculo del promedio

edad_media = estudiantes["Campo 5"].mean()
int(edad_media)

28

In [85]:
# Estoy reemplazando los NaN con un dato, en este caso con la media
estudiantes["Campo 5"].fillna(int(edad_media),inplace = True)
estudiantes

             Campo 1    Campo 3   Campo 4  Campo 5
campo_2
Paco      Registro 2      Silva    736923     35.0
Jennifer  Registro 6    Ramírez    777222     30.0
Marcos    Registro 5   González   2233434     29.0
Hugo      Registro 1      López    123455     20.0
Luis      Registro 3        Oca    971298     28.0
Pedro     Registro 4    Ramírez    123098     28.0

In [86]:
# Ordenamiento con respecto a 2 columnas

estudiantes.sort_values(by = ["Campo 3","Campo 5"], ascending = [True,False], inplace = True)
estudiantes

             Campo 1    Campo 3   Campo 4  Campo 5
campo_2
Marcos    Registro 5   González   2233434     29.0
Hugo      Registro 1      López    123455     20.0
Luis      Registro 3        Oca    971298     28.0
Jennifer  Registro 6    Ramírez    777222     30.0
Pedro     Registro 4    Ramírez    123098     28.0
Paco      Registro 2      Silva    736923     35.0

In [87]:
# Filtrar los estudiantes de apellido Ramírez
estudiantes[estudiantes["Campo 3"] == "Ramírez"]

             Campo 1  Campo 3 Campo 4  Campo 5
campo_2
Jennifer  Registro 6  Ramírez  777222     30.0
Pedro     Registro 4  Ramírez  123098     28.0

In [88]:
# Función vectorizada de UPPER es str.upper 

estudiantes["Campo 3"] = estudiantes["Campo 3"].str.upper()
estudiantes

             Campo 1    Campo 3   Campo 4  Campo 5
campo_2
Marcos    Registro 5   GONZÁLEZ   2233434     29.0
Hugo      Registro 1      LÓPEZ    123455     20.0
Luis      Registro 3        OCA    971298     28.0
Jennifer  Registro 6    RAMÍREZ    777222     30.0
Pedro     Registro 4    RAMÍREZ    123098     28.0
Paco      Registro 2      SILVA    736923     35.0

In [89]:
# Funcion vectorizada que devulve el largo de los elementos de una columna
estudiantes["Campo 4"].str.len()

campo_2
Marcos      8
Hugo        6
Luis        6
Jennifer    6
Pedro       6
Paco        6
Name: Campo 4, dtype: int64

In [90]:
# Agrego una linea de datos extra
# Agrego una columna estado

estudiantes.loc["Peter"] = ["Registro 7","González","536271",23]
estudiantes["Estado"] = ["Activo","Baja","Baja","Graduado","Activo","Activo","Baja"]

estudiantes

             Campo 1    Campo 3   Campo 4  Campo 5    Estado
campo_2
Marcos    Registro 5   GONZÁLEZ   2233434     29.0    Activo
Hugo      Registro 1      LÓPEZ    123455     20.0      Baja
Luis      Registro 3        OCA    971298     28.0      Baja
Jennifer  Registro 6    RAMÍREZ    777222     30.0  Graduado
Pedro     Registro 4    RAMÍREZ    123098     28.0    Activo
Paco      Registro 2      SILVA    736923     35.0    Activo
Peter     Registro 7   González    536271     23.0      Baja

In [91]:
# Crea una columna por cada valor diferente de una columna elejida 
# y muestra cual es el estado asignnado un 1, sirve en regresiones logísticas

pd.get_dummies(estudiantes["Estado"])

          Activo  Baja  Graduado
campo_2
Marcos         1     0         0
Hugo           0     1         0
Luis           0     1         0
Jennifer       0     0         1
Pedro          1     0         0
Paco           1     0         0
Peter          0     1         0

In [92]:
# Con el get_dummis no se altera la tabla, crea una nueva con el contenido entonces
# si me van a servir los datos yo los pego con concat a la tabla original

Frame = pd.concat([estudiantes,pd.get_dummies(estudiantes["Estado"])], axis = 1)
Frame

,Campo 1,Campo 3,Campo 4,Campo 5,Estado,Activo,Baja,Graduado
campo_2,,,,,,,,
Marcos,Registro 5,GONZÁLEZ,2233434,29.0,Activo,1,0,0
Hugo,Registro 1,LÓPEZ,123455,20.0,Baja,0,1,0
Luis,Registro 3,OCA,971298,28.0,Baja,0,1,0
Jennifer,Registro 6,RAMÍREZ,777222,30.0,Graduado,0,0,1
Pedro,Registro 4,RAMÍREZ,123098,28.0,Activo,1,0,0
Paco,Registro 2,SILVA,736923,35.0,Activo,1,0,0
Peter,Registro 7,González,536271,23.0,Baja,0,1,0

In [93]:
Frame["Fac"] = [4,3,1,4,5,1,8]
Frame["Sexo"] = ["1","1","1","0","1","1","1"]
Frame

,Campo 1,Campo 3,Campo 4,Campo 5,Estado,Activo,Baja,Graduado,Fac,Sexo
campo_2,,,,,,,,,,
Marcos,Registro 5,GONZÁLEZ,2233434,29.0,Activo,1,0,0,4,1
Hugo,Registro 1,LÓPEZ,123455,20.0,Baja,0,1,0,3,1
Luis,Registro 3,OCA,971298,28.0,Baja,0,1,0,1,1
Jennifer,Registro 6,RAMÍREZ,777222,30.0,Graduado,0,0,1,4,0
Pedro,Registro 4,RAMÍREZ,123098,28.0,Activo,1,0,0,5,1
Paco,Registro 2,SILVA,736923,35.0,Activo,1,0,0,1,1
Peter,Registro 7,González,536271,23.0,Baja,0,1,0,8,1

In [94]:
# Sumo el valor de la columna Fac agrupado por cada uno de los Estados

Frame.groupby('Estado')["Fac"].sum() # En R es tapply(Frame$Fac,Frame$Estado,sum)

Estado
Activo      10
Baja        12
Graduado     4
Name: Fac, dtype: int64

In [95]:
# Agrupa por estado y Sexo y suma por Fac

Frame.groupby(['Estado',"Sexo"])["Fac"].sum() # En R es tapply(Frame$Fac,list(Frame$Estado,Frame$Sexo),sum)

Estado    Sexo
Activo    1       10
Baja      1       12
Graduado  0        4
Name: Fac, dtype: int64

In [ ]:
Frame.groupby(["Estado","Sexo"])["Fac"].sum()["Activo","0"]

In [98]:
Frame.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, Marcos to Peter
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Campo 1   7 non-null      object
 1   Campo 3   7 non-null      object
 2   Campo 4   7 non-null      object
 3   Campo 5   7 non-null      float64
 4   Estado    7 non-null      object
 5   Activo    7 non-null      uint8
 6   Baja      7 non-null      uint8
 7   Graduado  7 non-null      uint8
 8   Fac       7 non-null      int64
 9   Sexo      7 non-null      object
dtypes: float64(1), int64(1), object(5), uint8(3)
memory usage: 469.0+ bytes

In [99]:
# Reemplazo los 0 que tengo en la columna sexo por la palabra
# mujer en una nueva columna llamada SEXO y lo mismo para hombre

Frame["SEXO"] = np.where(Frame["Sexo"]=="0","mujer","hombre")

In [100]:
Frame

,Campo 1,Campo 3,Campo 4,Campo 5,Estado,Activo,Baja,Graduado,Fac,Sexo,SEXO
campo_2,,,,,,,,,,,
Marcos,Registro 5,GONZÁLEZ,2233434,29.0,Activo,1,0,0,4,1,hombre
Hugo,Registro 1,LÓPEZ,123455,20.0,Baja,0,1,0,3,1,hombre
Luis,Registro 3,OCA,971298,28.0,Baja,0,1,0,1,1,hombre
Jennifer,Registro 6,RAMÍREZ,777222,30.0,Graduado,0,0,1,4,0,mujer
Pedro,Registro 4,RAMÍREZ,123098,28.0,Activo,1,0,0,5,1,hombre
Paco,Registro 2,SILVA,736923,35.0,Activo,1,0,0,1,1,hombre
Peter,Registro 7,González,536271,23.0,Baja,0,1,0,8,1,hombre